# -*- coding: utf-8 -*-
# Author: Cynthia

"""
    插入排序
"""

"""
    3989921
    
    第一个元素不用管
    
    第二个元素, 往左边已有序的去插入, 之后得到长度为2的有序
    
    第三个元素, 重复上述过程, 往左边长度为2的有序列表里插入

"""

l = [3, 9, 8, 9, 9, 2, 1]

for i in range(2, len(l)):

    t = l[i]

    p = i-1

    # while p >= 0:
    #     if l[p] > t:
    #         l[p+1] = l[p]
    #         p -= 1
    #     else:
    #         break

    # 下面这种写法更简洁, 但相对的更难理解些
    while p >= 0 and l[p] > t:
        l[p+1] = l[p]
        p -= 1

    # 循环退出条件, p越界即-1; p没越界, 第一个小于等于t的元素, p+1位置大于t且已移走
    l[p+1] = t

print(l)
