# -*- coding: utf-8 -*-
# Author: Cynthia

"""
    假设数组从k扩大到2k需要3k个网络硬币, 则在摊销工作中, 每次增添操作应收费多少
    分别用往后摊销负债和往后摊销资产两种思路
"""

"""
    摊销负债

    0-1
    1-1

    2-4
    3-4

    4-8
    5-8
    6-8
    7-8

    8-16

    每次遇到2^k节点时, 数组扩展大小, 负责摊销的节点为 2^k ~ 2^(k+1)-1 共计 2^k个节点

    根据题目假设, 从2^k扩展到2*2^k需要3*2^k个网络硬币

    摊销到每个头上是 3*2^k/2^k = 3

    算上未摊销的部分, 每个append需要4个网络硬币
"""

"""
    摊销资产

    0-1
    1-1

    2-4
    3-4

    4-8
    5-8
    6-8
    7-8

    8-16

    遇到 2^k 节点, 数组大小扩展2倍, 需要网络硬币 3*2^k

    这3*2^k个硬币需要在2^(k-1)~2^k-1里共计2^(k-1)个元素里预收
    摊到每个头上是 3*2^k/2^(k-1) = 6

    即每个需要预收7个

"""