# -*- coding: utf-8 -*-
# Author: Cynthia

"""
    如果list初始不为空
    不断地append, 会怎样?
"""
import sys

def f(n):
    l = [0] * n

    for i in range(20):
        print(sys.getsizeof(l))
        l.append(i)
    print('===')

f(0)  # 72->32->32->64->72
f(1)  # 80->32->32->64->72
f(10)  # 152->64->72->80
f(20)  # 232->72->80->

"""
    从上述例子可以看到, list空间扩展是有固定序列的
    +4+4+8+9+10, 4-8-16-25-35
    
    初始到哪个区间, 第一步扩展就从哪开始
    
    比如0, 第一个区间, 扩展按照4-4-8-9-10
    1, 第一个区间, 同0
    10, 第三个区间, 8-9-10
    20, 第四个区间, 9-10
    
    猜测6, 在第二个区间, 按照4-8-9-10扩展
"""
f(6)  # 120->32->64->72